<img src = 'booksERD.png'>

In [82]:
# imports
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pandas as pd

In [83]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "Hulk3385SMASH!" # (whatever password you chose during mysql installation)
db_name = "books"
connection = f"mysql+pymysql://root:Hulk3385smash!@localhost/Books"

In [84]:
# create engine
engine = create_engine(connection)

In [85]:
# create new database if doesn't exist
if database_exists(connection) == False:
    create_database(connection)
else:
    print("The database already exists.")

The database already exists.

## Adding user table

In [86]:
# read in users csv
users = pd.read_csv('users.csv')

# check
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [87]:
users.to_sql('users', engine, if_exists = 'replace')

3

In [88]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Adding book table

In [89]:
# read in books csv
books = pd.read_csv('books.csv')

# check
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [90]:
books.to_sql('books', engine, if_exists = 'replace')

6

In [91]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Adding author table

In [92]:
# read in authors csv
authors = pd.read_csv('authors.csv')

# check
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [93]:
authors.to_sql('authors', engine, if_exists = 'replace')

5

In [94]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Adding favorites table

In [95]:
# read in favorites csv
favorites = pd.read_csv('favorites.csv')

# check
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [96]:
favorites.to_sql('authors', engine, if_exists = 'replace')

7

In [97]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Testing the Database

In [98]:
q = """
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1